In [1]:
import pandas as pd
df = pd.read_csv('data.csv')
df['Bonus'] = df['Salary'] * 0.20
df['Total Salary'] = df['Bonus'] + df ['Salary']
df_sorted = df.sort_values(by='Name:', ascending=True)
df['Tax'] = df['Total Salary'] * 0.05
df['Net Salary'] = df['Total Salary'] - df['Tax']
df = df.drop('Age:', axis=1)
df

        Name:    City  Salary   Bonus  Total Salary     Tax  Net Salary
0   Nadir Ali  Sukkur   10000  2000.0       12000.0   600.0     11400.0
1  Irshad Ali     KHI   20000  4000.0       24000.0  1200.0     22800.0
2      Farman     ISB    3000   600.0        3600.0   180.0      3420.0

In [21]:
df[df['Bonus'] > 3000]
df[df['Bonus'] < 3000]['Bonus']

0    2000.0
2     600.0
Name: Bonus, dtype: float64

In [8]:
emp = pd.read_csv('employees_data .csv')
maxx = emp['Salary'].max()
maxx

128673

<built-in function bin>

In [7]:
import pandas as pd

df = pd.read_csv('data.csv')

# Step 2: Define the age categorization function
def categorize_age(age):
    if age < 30:
        return "Young"
    elif 30 <= age <= 40:
        return "Mid-Age"
    else:
        return "Old"


df['Age Category'] = df['Age:'].apply(categorize_age)
print(df[['Name:', 'Age:', 'Age Category']])

        Name:  Age: Age Category
0   Nadir Ali    20        Young
1  Irshad Ali    44          Old
2      Farman    34      Mid-Age

In [4]:
df

        Name:  Age:    City  Salary Age Category
0   Nadir Ali    20  Sukkur   10000        Young
1  Irshad Ali    44     KHI   20000          Old
2      Farman    34     ISB    3000      Mid-Age